const {
    writeRLE,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
    printNT,
} = require('./nametables');

const buffer = blankNT();

const lookup = flatLookup(`
0123456789ABCDEF
GHIJKLMNOPQRSTUV
WXYZ-#!######.##
########qweadzxc
################
################
################
################
################
################
################
################
################
################
################
###############
`);

drawTiles(buffer, lookup, `
################################
################################
###########ɴȴȴȴȴȴȴȴȴȴȴɵɴȴȴȴȴȴȴɵ#
##ɴȴȴȴȴȴȴɵ#ȵ#LINES-000ȶȵ######ȶ#
##ȵ######ȶ#ɶȷȷȷȷȷȷȷȷȷȷɷȵTOP###ȶ#
##ɶȷȷȷȷȷȷɷ#############ȵ######ȶ#
#######################ȵ######ȶ#
#######################ȵSCORE#ȶ#
#ɴȴȴȴȴȴȴȴȴɵ############ȵ000000ȶ#
#ȵ########ȶ############ȵ######ȶ#
#ȵ########ȶ############ɶȷȷȷȷȷȷɷ#
#ȵ########ȶ#####################
#ȵ####000#ȶ#####################
#ȵ########ȶ#############NEXT####
#ȵ####000#ȶ#####################
#ȵ########ȶ#####################
#ȵ####000#ȶ#####################
#ȵ########ȶ#####################
#ȵ####000#ȶ#####################
#ȵ########ȶ############ɴȴȴȴȴȴɵ##
#ȵ####000#ȶ############ȵLEVELȶ##
#ȵ########ȶ############ȵ#####ȶ##
#ȵ####000#ȶ############ɶȷȷȷȷȷɷ##
#ȵ########ȶ#####################
#ȵ####000#ȶ#####################
#ȵ########ȶ#####################
#ɶȷȷȷȷȷȷȷȷɷ#####################
################################
################################
################################
`);

drawTiles(buffer, lookup, `
ʞʟʠʠʒʝʞʜʕʞʟʠʜʙʜʙʠʡʟʜʓʡʐʑʟʡʜʕʞʒʞʟ
ʒʙʡʠʡʟʜʓʡʒʙʡʜʝʝʞʡʜʚʞʘʞʖʗʘʝʞʡʜʙʜʛ
ʡʒʞʡʜʚʞʘʞʡʟ####################ʡ
ʟʠ########ʠ####################ʟ
ʠʡ########ʠ####################ʠ
ʖʞ########ʡɰȰȰȰȰȰȰȰȰȰȰɱ########ʠ
ʜʝʝʞʟʐʑʟʜʝʓȱ##########Ȳ########ʡ
ʝʞʜʝʙʖʗʘʝʞʡȱ##########Ȳ########ʟ
ʓ##########ȱ##########Ȳ########ʘ
ʠ#ɩɪɫɬɭɮɯɟ#ȱ##########Ȳ########ʟ
ʡ##########ȱ##########Ȳ########ʠ
ʞ##ɀɁɂ#####ȱ##########Ȳʜʝʝʞʜʝʓʜʙ
ʞ##ɐɑɒ#####ȱ##########ȲɰȰȰȰȰɱʡʟʜ
ʞ##ɉɊɋ#####ȱ##########Ȳȱ####Ȳʒʙʜ
ʟ##əɚɛ#####ȱ##########Ȳȱ####Ȳʡʒʞ
ʠ##Ɇɇ######ȱ##########Ȳȱ####Ȳʜʙʐ
ʠ##ɖɗɘ#####ȱ##########Ȳȱ####Ȳʒʞʖ
ʡ##ɠɡ######ȱ##########Ȳȱ####Ȳʠʜʓ
ʑ##ɢɣ######ȱ##########Ȳɲȳȳȳȳɳʡʟʠ
ʗ##ɃɄɅ#####ȱ##########Ȳ#######ʠʡ
ʞ##ɓɔɕ#####ȱ##########Ȳ#######ʠʜ
ʞ##ɌɍɎ#####ȱ##########Ȳ#######ʡʟ
ʟ##ɜɝɞ#####ȱ##########Ȳ#######ʜʛ
ʙ##########ȱ##########Ȳʟʜʕʞʟʒʝʞʡ
ʓ##ɤɥɦ#####ȱ##########Ȳʔʞʡʜʛʡʟʜʝ
ʠ##########ȱ##########Ȳʡʜʝʓʡʒʙʒʞ
ʡ##########ɲȳȳȳȳȳȳȳȳȳȳɳʟʐʑʡʟʡʜʙʟ
ʟʟʜʕʞʒʝʞʟʜʓʜʓʟʒʞʒʝʞʜʝʝʞʠʖʗʜʛʟʜʝʙ
ʠʘʓʡʟʡʟʒʙʟʘʞʠʠʠʟʡʟʐʑʒʞʟʖʞʜʓʡʠʜʝʝ
ʖʞʡʜʚʞʠʡʜʚʞʟʡʠʡʠʒʙʖʗʠʟʘʝʞʟʠʜʙʒʞʟ
`);

drawAttrs(buffer, [`
    3333333333333333
    3333333333333333
    3333333333333333
    3333332222233333
    3333332222233333
    3220032222233333
    3220032222233333
    3220032222233333
`, `
    3220032222233333
    3220032222233333
    3220032222233333
    3220032222233333
    3220032222233333
    3333333333333333
    3333333333333333
    0000000000000000
`]);

writeRLE(
    __dirname + '/game_nametable_practise.bin',
    buffer,
);
